//=============================================================================
//
// 岩処理 [rock.h]
// Author : 
//
//=============================================================================
#pragma once


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitRock(void);
void UninitRock(void);
void UpdateRock(void);
void DrawRock(void);

int SetRock(XMFLOAT3 pos, float fWidth, float fHeight, XMFLOAT4 col);


